Table of Contents
 Interface IIdeaLoadGroup
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaLoadGroup : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Dzeta
ζ
double Dzeta { get; }
Property Value
double
 GammaGInf
γ G,Inf
double GammaGInf { get; }
Property Value
double
 GammaGSup
γ G,Sup
double GammaGSup { get; }
Property Value
double
 GammaQ
γ Q
double GammaQ { get; }
Property Value
double
 GroupType
Group type
LoadGroupType GroupType { get; }
Property Value
LoadGroupType
 Psi0
ψ 0
double Psi0 { get; }
Property Value
double
 Psi1
ψ 1
double Psi1 { get; }
Property Value
double
 Psi2
ψ 2
double Psi2 { get; }
Property Value
double
 Relation
Relation
Relation Relation { get; }
Property Value
Relation
 Edit this page